version = 1
print('Запуск...')
time.sleep(0.5)
os.system('cls')
print('Запуск │')
time.sleep(0.5)
os.system('cls')
print('Запуск ╱')
time.sleep(0.5)
os.system('cls')
print('Запуск ―')
time.sleep(0.5)
os.system('cls')
print('Запуск ╲')
time.sleep(0.5)
os.system('cls')
print('Запуск │')
time.sleep(0.5)
os.system('cls')
print('Запуск ╱')
time.sleep(0.5)
os.system('cls')
print('Запуск ―')
time.sleep(0.5)
os.system('cls')
print('Запуск ╲')
time.sleep(0.5)
os.system('cls')
print('Запуск │')
time.sleep(0.5)
os.system('cls')
print('Открываю...')
time.sleep(1)
os.system('cls')
print('''
╔╗╔═╗
║║║╔╝
║╚╝╝─
║╔╗║─
║║║╚╗
╚╝╚═╝ 
''')
time.sleep(0.2)
os.system('cls')
print('''
╔╗╔═╗╔═══╗
║║║╔╝║╔═╗║
║╚╝╝─║║─║║
║╔╗║─║║─║║
║║║╚╗║╚═╝║
╚╝╚═╝╚═══╝
''')
time.sleep(0.2)
os.system('cls')
print('''
╔╗╔═╗╔═══╗╔═══╗
║║║╔╝║╔═╗║╚╗╔╗║
║╚╝╝─║║─║║─║║║║
║╔╗║─║║─║║─║║║║
║║║╚╗║╚═╝║╔╝╚╝║
╚╝╚═╝╚═══╝╚═══╝
''')
time.sleep(0.2)
os.system('cls')
print('''
╔╗╔═╗╔═══╗╔═══╗     ╔═══╗
║║║╔╝║╔═╗║╚╗╔╗║     ║╔══╝
║╚╝╝─║║─║║─║║║║     ║╚══╗
║╔╗║─║║─║║─║║║║     ║╔══╝
║║║╚╗║╚═╝║╔╝╚╝║     ║║───
╚╝╚═╝╚═══╝╚═══╝     ╚╝───
''')
time.sleep(0.2)
os.system('cls')
print('''
╔╗╔═╗╔═══╗╔═══╗     ╔═══╗╔═══╗
║║║╔╝║╔═╗║╚╗╔╗║     ║╔══╝║╔═╗║
║╚╝╝─║║─║║─║║║║     ║╚══╗║║─║║
║╔╗║─║║─║║─║║║║     ║╔══╝║╚═╝║
║║║╚╗║╚═╝║╔╝╚╝║     ║║───║╔═╗║
╚╝╚═╝╚═══╝╚═══╝     ╚╝───╚╝─╚╝
''')
time.sleep(0.2)
os.system('cls')
print('''
╔╗╔═╗╔═══╗╔═══╗     ╔═══╗╔═══╗╔═══╗
║║║╔╝║╔═╗║╚╗╔╗║     ║╔══╝║╔═╗║║╔═╗║
║╚╝╝─║║─║║─║║║║     ║╚══╗║║─║║║╚═╝║
║╔╗║─║║─║║─║║║║     ║╔══╝║╚═╝║║╔╗╔╝
║║║╚╗║╚═╝║╔╝╚╝║     ║║───║╔═╗║║║║╚╗
╚╝╚═╝╚═══╝╚═══╝     ╚╝───╚╝─╚╝╚╝╚═╝
''')
time.sleep(0.2)
os.system('cls')
print('''
╔╗╔═╗╔═══╗╔═══╗     ╔═══╗╔═══╗╔═══╗╔═══╗
║║║╔╝║╔═╗║╚╗╔╗║     ║╔══╝║╔═╗║║╔═╗║║╔═╗║
║╚╝╝─║║─║║─║║║║     ║╚══╗║║─║║║╚═╝║║║─║║
║╔╗║─║║─║║─║║║║     ║╔══╝║╚═╝║║╔╗╔╝║╚═╝║
║║║╚╗║╚═╝║╔╝╚╝║     ║║───║╔═╗║║║║╚╗║╔═╗║
╚╝╚═╝╚═══╝╚═══╝     ╚╝───╚╝─╚╝╚╝╚═╝╚╝─╚╝
''')
time.sleep(0.2)
os.system('cls')
print('''
╔╗╔═╗╔═══╗╔═══╗     ╔═══╗╔═══╗╔═══╗╔═══╗╔═══╗
║║║╔╝║╔═╗║╚╗╔╗║     ║╔══╝║╔═╗║║╔═╗║║╔═╗║║╔═╗║
║╚╝╝─║║─║║─║║║║     ║╚══╗║║─║║║╚═╝║║║─║║║║─║║
║╔╗║─║║─║║─║║║║     ║╔══╝║╚═╝║║╔╗╔╝║╚═╝║║║─║║
║║║╚╗║╚═╝║╔╝╚╝║     ║║───║╔═╗║║║║╚╗║╔═╗║║╚═╝║
╚╝╚═╝╚═══╝╚═══╝     ╚╝───╚╝─╚╝╚╝╚═╝╚╝─╚╝╚═══╝
''')
time.sleep(0.2)
os.system('cls')
print('''
╔╗╔═╗╔═══╗╔═══╗     ╔═══╗╔═══╗╔═══╗╔═══╗╔═══╗╔═╗─╔╗
║║║╔╝║╔═╗║╚╗╔╗║     ║╔══╝║╔═╗║║╔═╗║║╔═╗║║╔═╗║║║╚╗║║
║╚╝╝─║║─║║─║║║║     ║╚══╗║║─║║║╚═╝║║║─║║║║─║║║╔╗╚╝║
║╔╗║─║║─║║─║║║║     ║╔══╝║╚═╝║║╔╗╔╝║╚═╝║║║─║║║║╚╗║║
║║║╚╗║╚═╝║╔╝╚╝║     ║║───║╔═╗║║║║╚╗║╔═╗║║╚═╝║║║─║║║
╚╝╚═╝╚═══╝╚═══╝     ╚╝───╚╝─╚╝╚╝╚═╝╚╝─╚╝╚═══╝╚╝─╚═╝
''')
time.sleep(0.2)
os.system('cls')
print('''
╔╗╔═╗╔═══╗╔═══╗     ╔═══╗╔═══╗╔═══╗╔═══╗╔═══╗╔═╗─╔╗╔═══╗
║║║╔╝║╔═╗║╚╗╔╗║     ║╔══╝║╔═╗║║╔═╗║║╔═╗║║╔═╗║║║╚╗║║║╔═╗║
║╚╝╝─║║─║║─║║║║     ║╚══╗║║─║║║╚═╝║║║─║║║║─║║║╔╗╚╝║║║─║║
║╔╗║─║║─║║─║║║║     ║╔══╝║╚═╝║║╔╗╔╝║╚═╝║║║─║║║║╚╗║║║╚═╝║
║║║╚╗║╚═╝║╔╝╚╝║     ║║───║╔═╗║║║║╚╗║╔═╗║║╚═╝║║║─║║║║╔═╗║
╚╝╚═╝╚═══╝╚═══╝     ╚╝───╚╝─╚╝╚╝╚═╝╚╝─╚╝╚═══╝╚╝─╚═╝╚╝─╚╝
''')
time.sleep(0.2)
os.system('cls')
print('''
╔╗╔═╗╔═══╗╔═══╗     ╔═══╗╔═══╗╔═══╗╔═══╗╔═══╗╔═╗─╔╗╔═══╗
║║║╔╝║╔═╗║╚╗╔╗║     ║╔══╝║╔═╗║║╔═╗║║╔═╗║║╔═╗║║║╚╗║║║╔═╗║   By Petr
║╚╝╝─║║─║║─║║║║     ║╚══╗║║─║║║╚═╝║║║─║║║║─║║║╔╗╚╝║║║─║║
║╔╗║─║║─║║─║║║║     ║╔══╝║╚═╝║║╔╗╔╝║╚═╝║║║─║║║║╚╗║║║╚═╝║   V1.0
║║║╚╗║╚═╝║╔╝╚╝║     ║║───║╔═╗║║║║╚╗║╔═╗║║╚═╝║║║─║║║║╔═╗║
╚╝╚═╝╚═══╝╚═══╝     ╚╝───╚╝─╚╝╚╝╚═╝╚╝─╚╝╚═══╝╚╝─╚═╝╚╝─╚╝ 
''')
time.sleep(1)
os.system('cls')


def menu():
    mod = input('''
Выберите, что вы хотите сделать:
[1] Запустить программу
[2] Обновить программу
[0] Выход
''')
    mode = int(mod)
    if mode == 1:
        def proga():
            os.system('cls')
            print('')      #Тут будет сама программа

            def checkver():
                global version
                print("Проверка обновлений")
                try:
                    upd = requests.get('https://raw.githubusercontent.com/Petr621/far/main/version.txt')
                    upd_ver = float(upd.text[0:3])
                    print('Последняя версия - ' + upd_ver)
                    print('Ваша текущая версия - ' + version)
                    if upd_ver > version:
                        print("Найдено обновление " + upd.text[0:3] + "\nИзменения:\n" + upd.text[4:])
                        print("\nНачато обновление")
                        os.system("cd $HOME && rm -rf far && git clone https://github.com/Petr621/far && cd far")
                        os.system("chmod +x menu.py")
                        print("\nОбновление завершено, Открываю...")
                        time.sleep(5)
                        os.system("./menu.py")

                    else:
                        print("Ошибка, файл обновлений не найден")
                except BaseException:
                    print("Нет интернета, попробуйте позже")

            checkver()
        proga()
        end
    if mode == 2:
        def obnov():
            os.system('cls')
            os.system()    #Тут будет ссылка на гит + команда git clone
        obnov()
    if mode == 0:
        def vix():
            os.system('cls')
            end    #Тут мы выходим из программы
        vix()


menu()
